In [2]:
# Grouping columns
# import libraries
import pandas as pd
import numpy as np

In [5]:
# Dictionary
data = {'Company':['GOOG', 'GOOG', 'SAS', 'SAS', 'FB', 'FB'],
        'Persons':['Sam', 'Charles', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 320, 124, 243, 350]}

In [7]:
#Create dataFrame
df = pd.DataFrame(data)

In [8]:
df

  Company  Persons  Sales
0    GOOG      Sam    200
1    GOOG  Charles    120
2     SAS      Amy    320
3     SAS  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [15]:
# Groupby Company
comGroup = df.groupby('Company')

In [16]:
# Find the mean of the Company object
comGroup.mean()

         Sales
Company
FB       296.5
GOOG     160.0
SAS      222.0

In [17]:
# Sum of sales for the same company
comGroup.sum()

         Sales
Company
FB         593
GOOG       320
SAS        444

In [18]:
# Sales or sum for a specific company
comGroup.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [19]:
# Count number of instances per column 
comGroup.count()

         Persons  Sales
Company
FB             2      2
GOOG           2      2
SAS            2      2

In [20]:
# Max column sales first
comGroup.max()

         Persons  Sales
Company
FB         Sarah    350
GOOG         Sam    200
SAS      Vanessa    320

In [21]:
# Min column sales first
comGroup.min()

         Persons  Sales
Company
FB          Carl    243
GOOG     Charles    120
SAS          Amy    124

In [22]:
# Describing a dataFrame
comGroup.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
SAS       2.0  222.0  138.592929  124.0  173.00  222.0  271.00  320.0

In [23]:
# Transposing a Dataframe
comGroup.describe().transpose()

Company              FB        GOOG         SAS
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  222.000000
      std     75.660426   56.568542  138.592929
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  173.000000
      50%    296.500000  160.000000  222.000000
      75%    323.250000  180.000000  271.000000
      max    350.000000  200.000000  320.000000

In [24]:
# Choosing a specfic column to transpose
comGroup.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64